<a href="https://colab.research.google.com/github/jingwoo4710/ds-admission-challenge/blob/master/Titanic_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [19]:
import pandas as pd
df = pd.read_csv('https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv')

In [54]:
df.head(2)

   Survived  Pclass  ... Parents/Children Aboard     Fare
0         0       3  ...                       0   7.2500
1         1       1  ...                       0  71.2833

[2 rows x 8 columns]

In [3]:
df.shape

(887, 8)

In [15]:
df = df[['Survived', 'Name', 'Sex', 'Age', 'Fare']]
df.head(2)

    Survived                           Name     Sex   Age   Fare
27         0  Mr. Charles Alexander Fortune    male  19.0  263.0
87         1      Miss. Mabel Helen Fortune  female  23.0  263.0

In [10]:
print(df["Fare"].quantile(0.5))

print(df["Fare"].mean())

14.4542
32.30542018038328

In [26]:
top_100 = df['Fare'].quantile(0.89)

data = df.copy()[df['Fare'] >= top_100]

average = data['Fare'].mean()

data.shape

(102, 8)

In [29]:
def percent_above_average (d, average = average):
  fare = d['Fare']
  return (fare - average) / average * 100

data['percent_above_average'] = data.apply(percent_above_average, axis = 1)

data.head(2)

    Survived  Pclass  ...      Fare percent_above_average
27         0       1  ...  263.0000             92.855508
31         1       1  ...  146.5208              7.442370

[2 rows x 9 columns]

In [53]:
info = "{'Bob': [['I liked it.','Love'], ['It was awful.', 'Star']], 'Sue': ['Pretty good.', 'Bland.']}"


print(type(info))

from ast import literal_eval

info = literal_eval(info)

print(type(info))

info_df = pd.DataFrame(info)

info_df.head(2)

info_df['Bob'].apply(lambda x : " ".join(x))

<class 'str'>
<class 'dict'>
['Pretty good.', 'Bland.']
['Pretty good.', 'Bland.']

0      I liked it. Love
1    It was awful. Star
Name: Bob, dtype: object